{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantiinput0_input_shift_history", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiInput", 
      "name": "quantiinput0", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp2_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp2_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_sp_out1_dw_sp2", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1], [13, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_dw_sp1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_sp_out1_dw_sp1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[8, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1], [21, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_sp_out1_pw_sp1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp2_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out1_pw_sp2_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_sp_out1_pw_sp2", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_dw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_dw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_dw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_dw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_dw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_sp_out2_dw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_pw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_pw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_dw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_dw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_dw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_dw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_dw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_shortcut_dw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[8, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_pw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_pw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_pw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_pw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_shortcut_pw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_shortcut_pw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 1], [50, 0, 1], [51, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_pw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_pw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_res_sp_out2_pw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv2_res_sp_out2_pw", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fpn_p2_1x1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fpn_p2_1x1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp2_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp2_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_sp_out1_dw_sp2", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[56, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_dw_sp1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_sp_out1_dw_sp1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[56, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_sp_out1_pw_sp1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1], [77, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp2_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out1_pw_sp2_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_sp_out1_pw_sp2", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_dw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_dw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_dw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_dw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_dw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_sp_out2_dw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_pw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_pw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_dw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_dw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_dw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_dw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_dw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_shortcut_dw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "4", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[56, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1], [95, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_pw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_pw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_pw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_pw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_shortcut_pw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_shortcut_pw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_pw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_pw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_res_sp_out2_pw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv3_res_sp_out2_pw", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [102, 0, 0], [103, 0, 1], [104, 0, 1], [105, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fpn_p3_1x1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fpn_p3_1x1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp2_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp2_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_sp_out1_dw_sp2", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[106, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 1], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_dw_sp1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_sp_out1_dw_sp1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[106, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_sp_out1_pw_sp1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1], [127, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp2_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out1_pw_sp2_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_sp_out1_pw_sp2", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_dw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_dw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_dw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_dw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_dw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_sp_out2_dw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 1], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_pw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_sp_out2_pw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_dw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_dw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_dw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_dw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_dw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_shortcut_dw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[106, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 1], [144, 0, 1], [145, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_pw_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_pw_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_pw_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_pw_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_res_shortcut_pw_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv4_res_shortcut_pw", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 1], [150, 0, 1], [151, 0, 1]]
    }, 
    {
      "op": "null", 
