{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantiinput0_input_shift_history", 
      "attr": {
        "__predict__": "False", 
        "fixed_output_shift": "7"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiInput", 
      "name": "quantiinput0", 
      "attr": {
        "__predict__": "False", 
        "fixed_output_shift": "7"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_conv1_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_conv1_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_conv1", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[2, 0, 0], [5, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "quantiactivation0", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False", 
        "act_type": "relu"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_conv1_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[12, 0, 0], [15, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "quantiactivation1", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False", 
        "act_type": "relu"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[22, 0, 0], [25, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "quantiactivation2", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False", 
        "act_type": "relu"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep1_data_conv2d_pointwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[32, 0, 0], [35, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[41, 0, 0], [44, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[12, 0, 0], [51, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_shortcut_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[57, 0, 0], [60, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_shortcut_conv2d_pointwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False"
      }, 
      "inputs": [[48, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnet_head_headstage_sep2_data_conv2d_pointwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[69, 0, 0], [72, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "quantiactivation3", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False", 
        "act_type": "relu"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[79, 0, 0], [82, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[69, 0, 0], [89, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[95, 0, 0], [98, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False"
      }, 
      "inputs": [[86, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "quantiactivation4", 
      "attr": {
        "__force_mirroring__": "True", 
        "__predict__": "False", 
        "act_type": "relu"
      }, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[108, 0, 0], [111, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[117, 0, 0], [120, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise", 
      "attr": {
        "__predict__": "False", 
        "__wd_mult__": "1", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[69, 0, 0], [127, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_weight", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_wshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_wshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "weight", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_bias", 
      "attr": {"__predict__": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_bshift_shift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_bshift", 
      "attr": {
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "7", 
        "quantization_type": "bias", 
        "use_aux_shift": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 1]]
    }, 
    {
      "op": "Convolution", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise", 
      "attr": {
        "__predict__": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[133, 0, 0], [136, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_quantidata_shift", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
        "bias_bits": "8", 
        "bits": "8", 
        "init_shift": "4", 
        "quantization_type": "data"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantizationSte", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_quantidata", 
      "attr": {
        "__force_mirroring__": "True", 
        "__logging__": "True", 
        "__predict__": "False", 
