{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantiinput0_input_shift_history", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiInput", 
      "name": "quantiinput0", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_head_conv1_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_head_conv1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1], [13, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_headhead_pooling_sep1_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[8, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1], [33, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_headhead_pooling_shortcut_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnet_headhead_pooling_sep2_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [40, 0, 0], [41, 0, 1], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[44, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_sep1_data_branch_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_branch_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[44, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_shortcut_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_1_sep2_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1], [97, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_2_sep1_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1], [103, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_2_sep2_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0], [112, 0, 0], [92, 0, 0], [113, 0, 1], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_pointwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_pointwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_pointwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_pointwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_3_sep1_data_conv2d_pointwise", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1], [127, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_depthwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_depthwise_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_depthwise_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_depthwise_weight_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_depthwise_bias_shift_history", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_depthwise", 
      "attr": {
        "__predict__": "True", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "False", 
        "workspace": "512"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 1], [132, 0, 1], [133, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargnetstage_2_unit_3_sep2_data_conv2d_pointwise_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
