{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quanti_input_input_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiInput", 
      "name": "quanti_input", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7", 
        "output_valid_signed_bit": "8"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv0_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv0_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv1_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv1_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv1_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv1_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv1_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1_group_conv1_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "2", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1], [13, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv1_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv1_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv1_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv1_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv1_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1_pointwise_conv1_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv2_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv2_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv2_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv2_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_group_conv2_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1_group_conv2_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "2", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv2_merge_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv2_merge_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_group_convconv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_group_convconv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_group_convconv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_group_convconv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_group_convconv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1_dim_group_convconv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "2", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[8, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1], [33, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_pointwise_convconv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_pointwise_convconv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_pointwise_convconv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_pointwise_convconv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_dim_pointwise_convconv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1_dim_pointwise_convconv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv2_merge_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv2_merge_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_pointwise_conv2_merge_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "conv1_pointwise_conv2_merge_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [40, 0, 0], [41, 0, 1], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_group_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_group_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_group_conv_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_group_conv_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_group_conv_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_shortcut_group_conv_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "2", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_pointwise_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_pointwise_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_group_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_group_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_group_conv_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_group_conv_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_group_conv_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_cardinality2_group_conv_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "2", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[44, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_pointwise_conv_merge_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_pointwise_conv_merge_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_group_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_group_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_group_conv_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_group_conv_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_group_conv_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_cardinality1_group_conv_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "2", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[44, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_pointwise_convconv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_pointwise_convconv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_pointwise_convconv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_pointwise_convconv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality1_pointwise_convconv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_cardinality1_pointwise_convconv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_pointwise_conv_merge_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_pointwise_conv_merge_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_cardinality2_pointwise_conv_merge_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_cardinality2_pointwise_conv_merge_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1], [75, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_group_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_group_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_group_conv_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_group_conv_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_group_conv_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_merge_group_conv_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "4", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_pointwise_convconv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_pointwise_convconv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_pointwise_convconv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_pointwise_convconv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_merge_pointwise_convconv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_merge_pointwise_convconv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_pointwise_conv_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_pointwise_conv_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_shortcut_pointwise_conv_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit1_shortcut_pointwise_conv_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv1_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv1_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv1_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv1_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv1_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit2_group_conv1_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "4", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1], [97, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv1_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv1_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv1_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv1_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv1_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit2_pointwise_conv1_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1], [103, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv2_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv2_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv2_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv2_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_group_conv2_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit2_group_conv2_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "4", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv2_merge_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv2_merge_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv2_merge_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv2_merge_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_pointwise_conv2_merge_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage1_unit2_pointwise_conv2_merge_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "elementwise_input": "True", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "output_valid_signed_bit": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0], [112, 0, 0], [92, 0, 0], [113, 0, 1], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_group_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_group_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_group_conv_conv_output_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_group_conv_conv_weight_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_group_conv_conv_bias_vec_shift_history", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaPlusConvolution", 
      "name": "stage2_unit1_shortcut_group_conv_conv", 
      "attr": {
        "aligned_output_shift": "False", 
        "bias_shift_history": "None", 
        "bias_valid_signed_bit": "8", 
        "dilate": "(1, 1)", 
        "disable_output_quantization": "False", 
        "edata": "None", 
        "elementwise_input": "False", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "4", 
        "output_valid_signed_bit": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "use_activation": "True", 
        "vector_quanti": "True", 
        "weight_shift_history": "None", 
        "weight_valid_signed_bit": "8"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_pointwise_conv_conv_weight", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_shortcut_pointwise_conv_conv_bias", 
      "attr": {
        "__dtype__": "5", 
        "__init__": "[\"randomintinitializer\", {\"high\": 127, \"low\": -128}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
